Import libraries

In [1]:
import pandas as pd

Reading the csv file

In [2]:
df_meteorites = pd.read_csv('./Meteorite_Landings.csv')

### Head

Head shows the first five elements of the dataframe

Five is the default value of the number of elements to show but you can specify the number:

```
dataframe.head(number)
```

In [3]:
df_meteorites.head()

,name,id,nametype,recclass,mass (g),fall,year,reclat,reclong,GeoLocation
0,Aachen,1,Valid,L5,21.0,Fell,1880.0,50.77500,6.08333,"(50.775, 6.08333)"
1,Aarhus,2,Valid,H6,720.0,Fell,1951.0,56.18333,10.23333,"(56.18333, 10.23333)"
2,Abee,6,Valid,EH4,107000.0,Fell,1952.0,54.21667,-113.00000,"(54.21667, -113.0)"
3,Acapulco,10,Valid,Acapulcoite,1914.0,Fell,1976.0,16.88333,-99.90000,"(16.88333, -99.9)"
4,Achiras,370,Valid,L6,780.0,Fell,1902.0,-33.16667,-64.95000,"(-33.16667, -64.95)"

### Tail

Tail shows the last five elements of the dataframe

Five is the default value of the number of elements to show but you can specify the number:

```
dataframe.head(number)
```

In [4]:
df_meteorites.tail()

,name,id,nametype,recclass,mass (g),fall,year,reclat,reclong,GeoLocation
45711,Zillah 002,31356,Valid,Eucrite,172.0,Found,1990.0,29.03700,17.01850,"(29.037, 17.0185)"
45712,Zinder,30409,Valid,"Pallasite, ungrouped",46.0,Found,1999.0,13.78333,8.96667,"(13.78333, 8.96667)"
45713,Zlin,30410,Valid,H4,3.3,Found,1939.0,49.25000,17.66667,"(49.25, 17.66667)"
45714,Zubkovsky,31357,Valid,L6,2167.0,Found,2003.0,49.78917,41.50460,"(49.78917, 41.5046)"
45715,Zulu Queen,30414,Valid,L3.7,200.0,Found,1976.0,33.98333,-115.68333,"(33.98333, -115.68333)"

### Sample

Sample tooks a random number data of dataframe. You must specify the number of data.

In [5]:
df_meteorites.sample(5)

,name,id,nametype,recclass,mass (g),fall,year,reclat,reclong,GeoLocation
41107,Yamato 791915,27264,Valid,H4,3.47,Found,1979.0,-71.50000,35.66667,"(-71.5, 35.66667)"
23996,Meteorite Hills 01303,16535,Valid,LL5,6.90,Found,2001.0,-79.68333,159.75000,"(-79.68333, 159.75)"
42995,Yamato 86228,29734,Valid,H4,2.11,Found,1986.0,-71.50000,35.66667,"(-71.5, 35.66667)"
447,Kangra Valley,12246,Valid,H5,400.00,Fell,1897.0,32.08333,76.30000,"(32.08333, 76.3)"
38891,Yamato 74463,24841,Valid,H6,19.01,Found,1974.0,0.00000,35.66667,"(0.0, 35.66667)"

### Shape

In [6]:
df_meteorites.shape

(45716, 10)

### Size

In [7]:
df_meteorites.size

457160

### Describe

Generate descriptive statistics

In [8]:
df_meteorites.describe()

                 id      mass (g)          year        reclat       reclong
count  45716.000000  4.558500e+04  45425.000000  38401.000000  38401.000000
mean   26889.735104  1.327808e+04   1991.828817    -39.122580     61.074319
std    16860.683030  5.749889e+05     25.052766     46.378511     80.647298
min        1.000000  0.000000e+00    860.000000    -87.366670   -165.433330
25%    12688.750000  7.200000e+00   1987.000000    -76.714240      0.000000
50%    24261.500000  3.260000e+01   1998.000000    -71.500000     35.666670
75%    40656.750000  2.026000e+02   2003.000000      0.000000    157.166670
max    57458.000000  6.000000e+07   2101.000000     81.166670    354.473330

You can change the numbers (float) display format

In [9]:
pd.options.display.float_format = '{:,.1f}'.format
df_meteorites.describe()

            id     mass (g)     year   reclat  reclong
count 45,716.0     45,585.0 45,425.0 38,401.0 38,401.0
mean  26,889.7     13,278.1  1,991.8    -39.1     61.1
std   16,860.7    574,988.9     25.1     46.4     80.6
min        1.0          0.0    860.0    -87.4   -165.4
25%   12,688.8          7.2  1,987.0    -76.7      0.0
50%   24,261.5         32.6  1,998.0    -71.5     35.7
75%   40,656.8        202.6  2,003.0      0.0    157.2
max   57,458.0 60,000,000.0  2,101.0     81.2    354.5

In [10]:
df_meteorites.describe(include='all')

,name,id,nametype,recclass,mass (g),fall,year,reclat,reclong,GeoLocation
count,45716,"45,716.0",45716,45716,"45,585.0",45716,"45,425.0","38,401.0","38,401.0",38401
unique,45716,NaN,2,466,NaN,2,NaN,NaN,NaN,17100
top,Aachen,NaN,Valid,L6,NaN,Found,NaN,NaN,NaN,"(0.0, 0.0)"
freq,1,NaN,45641,8285,NaN,44609,NaN,NaN,NaN,6214
mean,NaN,"26,889.7",NaN,NaN,"13,278.1",NaN,"1,991.8",-39.1,61.1,NaN
std,NaN,"16,860.7",NaN,NaN,"574,988.9",NaN,25.1,46.4,80.6,NaN
min,NaN,1.0,NaN,NaN,0.0,NaN,860.0,-87.4,-165.4,NaN
25%,NaN,"12,688.8",NaN,NaN,7.2,NaN,"1,987.0",-76.7,0.0,NaN
50%,NaN,"24,261.5",NaN,NaN,32.6,NaN,"1,998.0",-71.5,35.7,NaN
75%,NaN,"40,656.8",NaN,NaN,202.6,NaN,"2,003.0",0.0,157.2,NaN
max,NaN,"57,458.0",NaN,NaN,"60,000,000.0",NaN,"2,101.0",81.2,354.5,NaN

### Info

Print a concise summary of a DataFrame.

In [11]:
df_meteorites.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 45716 entries, 0 to 45715
Data columns (total 10 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   name         45716 non-null  object
 1   id           45716 non-null  int64
 2   nametype     45716 non-null  object
 3   recclass     45716 non-null  object
 4   mass (g)     45585 non-null  float64
 5   fall         45716 non-null  object
 6   year         45425 non-null  float64
 7   reclat       38401 non-null  float64
 8   reclong      38401 non-null  float64
 9   GeoLocation  38401 non-null  object
dtypes: float64(4), int64(1), object(5)
memory usage: 3.5+ MB

### Dtypes

This returns a Series with the data type of each column. The result’s index is the original DataFrame’s columns. *Columns with mixed types are stored with the object dtype.*

In [12]:
df_meteorites.dtypes

name            object
id               int64
nametype        object
recclass        object
mass (g)       float64
fall            object
year           float64
reclat         float64
reclong        float64
GeoLocation     object
dtype: object

Convert columns to best possible dtypes

In [13]:
df_meteorites.convert_dtypes().dtypes

name            string
id               Int64
nametype        string
recclass        string
mass (g)       Float64
fall            string
year             Int64
reclat         Float64
reclong        Float64
GeoLocation     string
dtype: object

### Nunique

Count number of distinct elements in specified axis.

In [14]:
df_meteorites.nunique()

name           45716
id             45716
nametype           2
recclass         466
mass (g)       12576
fall               2
year             265
reclat         12738
reclong        14640
GeoLocation    17100
dtype: int64

We look that nametype and fall have only 2 values along the dataset

### Astype

We convert that columns in categorical values

In [15]:
df_meteorites[['fall','nametype']] = df_meteorites[['fall','nametype']].astype('category')

In [16]:
df_meteorites.dtypes

name             object
id                int64
nametype       category
recclass         object
mass (g)        float64
fall           category
year            float64
reclat          float64
reclong         float64
GeoLocation      object
dtype: object

### Unique

Shows the unique values in the index

In [17]:
df_meteorites['fall'].unique()

['Fell', 'Found']
Categories (2, object): ['Fell', 'Found']

In [18]:
df_meteorites['nametype'].unique()

['Valid', 'Relict']
Categories (2, object): ['Relict', 'Valid']

### Value counts

Shows the times of values in the index

In [19]:
df_meteorites['fall'].value_counts()

Found    44609
Fell      1107
Name: fall, dtype: int64

In [20]:
df_meteorites['nametype'].value_counts()

Valid     45641
Relict       75
Name: nametype, dtype: int64

### Get dummies

Convert categorical variable into dummy/indicator variables.

In [21]:
df_meteorites[['fell','found']] = pd.get_dummies(df_meteorites['fall'])
df_meteorites[['Relict','Valid']] = pd.get_dummies(df_meteorites['nametype'])
df_meteorites.head()

,name,id,nametype,recclass,mass (g),fall,year,reclat,reclong,GeoLocation,fell,found,Relict,Valid
0,Aachen,1,Valid,L5,21.0,Fell,"1,880.0",50.8,6.1,"(50.775, 6.08333)",1,0,0,1
1,Aarhus,2,Valid,H6,720.0,Fell,"1,951.0",56.2,10.2,"(56.18333, 10.23333)",1,0,0,1
2,Abee,6,Valid,EH4,"107,000.0",Fell,"1,952.0",54.2,-113.0,"(54.21667, -113.0)",1,0,0,1
3,Acapulco,10,Valid,Acapulcoite,"1,914.0",Fell,"1,976.0",16.9,-99.9,"(16.88333, -99.9)",1,0,0,1
4,Achiras,370,Valid,L6,780.0,Fell,"1,902.0",-33.2,-65.0,"(-33.16667, -64.95)",1,0,0,1

### To datetime

Convert argument to datetime.

In [22]:
df_meteorites['year'] =  pd.to_datetime(
df_meteorites['year'],
errors = 'coerce',
format = '%Y')
df_meteorites.convert_dtypes().dtypes

name                   string
id                      Int64
nametype             category
recclass               string
mass (g)              Float64
fall                 category
year           datetime64[ns]
reclat                Float64
reclong               Float64
GeoLocation            string
fell                    UInt8
found                   UInt8
Relict                  UInt8
Valid                   UInt8
dtype: object

### Rename

In [23]:
df_meteorites.rename(columns={'mass (g)':'mass'}, inplace=True)
df_meteorites.head()

,name,id,nametype,recclass,mass,fall,year,reclat,reclong,GeoLocation,fell,found,Relict,Valid
0,Aachen,1,Valid,L5,21.0,Fell,1880-01-01,50.8,6.1,"(50.775, 6.08333)",1,0,0,1
1,Aarhus,2,Valid,H6,720.0,Fell,1951-01-01,56.2,10.2,"(56.18333, 10.23333)",1,0,0,1
2,Abee,6,Valid,EH4,"107,000.0",Fell,1952-01-01,54.2,-113.0,"(54.21667, -113.0)",1,0,0,1
3,Acapulco,10,Valid,Acapulcoite,"1,914.0",Fell,1976-01-01,16.9,-99.9,"(16.88333, -99.9)",1,0,0,1
4,Achiras,370,Valid,L6,780.0,Fell,1902-01-01,-33.2,-65.0,"(-33.16667, -64.95)",1,0,0,1

### Drop

Delete a element of the dataframe

In [24]:
df_meteorites.drop(['nametype', 'fall'], axis=1, inplace= True) # inplace do the changes in the df
df_meteorites.head()

,name,id,recclass,mass,year,reclat,reclong,GeoLocation,fell,found,Relict,Valid
0,Aachen,1,L5,21.0,1880-01-01,50.8,6.1,"(50.775, 6.08333)",1,0,0,1
1,Aarhus,2,H6,720.0,1951-01-01,56.2,10.2,"(56.18333, 10.23333)",1,0,0,1
2,Abee,6,EH4,"107,000.0",1952-01-01,54.2,-113.0,"(54.21667, -113.0)",1,0,0,1
3,Acapulco,10,Acapulcoite,"1,914.0",1976-01-01,16.9,-99.9,"(16.88333, -99.9)",1,0,0,1
4,Achiras,370,L6,780.0,1902-01-01,-33.2,-65.0,"(-33.16667, -64.95)",1,0,0,1

In [25]:
df_meteorites.drop(columns= ['id'], inplace= True)
df_meteorites.head()

,name,recclass,mass,year,reclat,reclong,GeoLocation,fell,found,Relict,Valid
0,Aachen,L5,21.0,1880-01-01,50.8,6.1,"(50.775, 6.08333)",1,0,0,1
1,Aarhus,H6,720.0,1951-01-01,56.2,10.2,"(56.18333, 10.23333)",1,0,0,1
2,Abee,EH4,"107,000.0",1952-01-01,54.2,-113.0,"(54.21667, -113.0)",1,0,0,1
3,Acapulco,Acapulcoite,"1,914.0",1976-01-01,16.9,-99.9,"(16.88333, -99.9)",1,0,0,1
4,Achiras,L6,780.0,1902-01-01,-33.2,-65.0,"(-33.16667, -64.95)",1,0,0,1